24-rails-deploying-to-heroku/app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("name", "date_made", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "do something"], ["date_made", "2019-04-16"], ["description", "cool"], ["created_at", "2019-04-15 20:37:56.840570"], ["updated_at", "2019-04-15 20:37:56.840570"]]